{
    "class_name": "Functional",
    "config": {
        "name": "EEGTCNet",
        "trainable": true,
        "layers": [
            {
                "module": "keras.layers",
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        250,
                        22,
                        1
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "input_eeg"
                },
                "registered_name": null,
                "name": "input_eeg",
                "inbound_nodes": []
            },
            {
                "module": "keras.layers",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_2",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 8,
                    "kernel_size": [
                        32,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        250,
                        22,
                        1
                    ]
                },
                "name": "conv2d_2",
                "inbound_nodes": [
                    [
                        [
                            "input_eeg",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_14",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        3
                    ],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "gamma_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_mean_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_variance_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        250,
                        22,
                        8
                    ]
                },
                "name": "batch_normalization_14",
                "inbound_nodes": [
                    [
                        [
                            "conv2d_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "DepthwiseConv2D",
                "config": {
                    "name": "depthwise_conv2d_2",
                    "trainable": true,
                    "dtype": "float32",
                    "kernel_size": [
                        1,
                        22
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "depth_multiplier": 2,
                    "depthwise_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "depthwise_regularizer": null,
                    "depthwise_constraint": {
                        "module": "keras.constraints",
                        "class_name": "MaxNorm",
                        "config": {
                            "max_value": 1.0,
                            "axis": 0
                        },
                        "registered_name": null
                    }
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        250,
                        22,
                        8
                    ]
                },
                "name": "depthwise_conv2d_2",
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_14",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_15",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        3
                    ],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "gamma_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_mean_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_variance_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        250,
                        1,
                        16
                    ]
                },
                "name": "batch_normalization_15",
                "inbound_nodes": [
                    [
                        [
                            "depthwise_conv2d_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Activation",
                "config": {
                    "name": "activation_17",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "elu"
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        250,
                        1,
                        16
                    ]
                },
                "name": "activation_17",
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_15",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "AveragePooling2D",
                "config": {
                    "name": "average_pooling2d_4",
                    "trainable": true,
                    "dtype": "float32",
                    "pool_size": [
                        8,
                        1
                    ],
                    "padding": "valid",
                    "strides": [
                        8,
                        1
                    ],
                    "data_format": "channels_last"
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        250,
                        1,
                        16
                    ]
                },
                "name": "average_pooling2d_4",
                "inbound_nodes": [
                    [
                        [
                            "activation_17",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_12",
                    "trainable": true,
                    "dtype": "float32",
                    "rate": 0.2,
                    "noise_shape": null,
                    "seed": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        31,
                        1,
                        16
                    ]
                },
                "name": "dropout_12",
                "inbound_nodes": [
                    [
                        [
                            "average_pooling2d_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "SeparableConv2D",
                "config": {
                    "name": "separable_conv2d_2",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 16,
                    "kernel_size": [
                        16,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "depth_multiplier": 1,
                    "depthwise_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "pointwise_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "depthwise_regularizer": null,
                    "pointwise_regularizer": null,
                    "depthwise_constraint": null,
                    "pointwise_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        31,
                        1,
                        16
                    ]
                },
                "name": "separable_conv2d_2",
                "inbound_nodes": [
                    [
                        [
                            "dropout_12",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_16",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        3
                    ],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "gamma_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_mean_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_variance_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        31,
                        1,
                        16
                    ]
                },
                "name": "batch_normalization_16",
                "inbound_nodes": [
                    [
                        [
                            "separable_conv2d_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Activation",
                "config": {
                    "name": "activation_18",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "elu"
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        31,
                        1,
                        16
                    ]
                },
                "name": "activation_18",
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_16",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "AveragePooling2D",
                "config": {
                    "name": "average_pooling2d_5",
                    "trainable": true,
                    "dtype": "float32",
                    "pool_size": [
                        8,
                        1
                    ],
                    "padding": "valid",
                    "strides": [
                        8,
                        1
                    ],
                    "data_format": "channels_last"
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        31,
                        1,
                        16
                    ]
                },
                "name": "average_pooling2d_5",
                "inbound_nodes": [
                    [
                        [
                            "activation_18",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_13",
                    "trainable": true,
                    "dtype": "float32",
                    "rate": 0.2,
                    "noise_shape": null,
                    "seed": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        3,
                        1,
                        16
                    ]
                },
                "name": "dropout_13",
                "inbound_nodes": [
                    [
                        [
                            "average_pooling2d_5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Lambda",
                "config": {
                    "name": "lambda_3",
                    "trainable": true,
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAAAAAAYAAAATAAAA8yYAAACXAHwAZABkAIUCZABkAIUCZAFkAGQAhQJmBBkAAAAA\nAAAAAABTAKkCTun/////qQCpAdoBeHMBAAAAIPpML2V0aW5mby91c2VyczIvcWxhbmdsb2lzL2hh\nY2thdG9uXzIwMjQvY3VzdG9tX2FyY2hpdGVjdHVyZXMvc290YV9lZWdfYXJjaC5wefoIPGxhbWJk\nYT76GkVFR1RDTmV0Ljxsb2NhbHM+LjxsYW1iZGE+4gEAAPMeAAAAgACYYaABoAGgAaAxoDGgMaBi\nqCGoIaghoAucboAA8wAAAAA=\n",
                        null,
                        null
                    ],
                    "function_type": "lambda",
                    "module": "custom_architectures.sota_eeg_arch",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "output_shape_module": null,
                    "arguments": {}
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        3,
                        1,
                        16
                    ]
                },
                "name": "lambda_3",
                "inbound_nodes": [
                    [
                        [
                            "dropout_13",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Conv1D",
                "config": {
                    "name": "conv1d_10",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 12,
                    "kernel_size": [
                        4
                    ],
                    "strides": [
                        1
                    ],
                    "padding": "causal",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "HeUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        3,
                        16
                    ]
                },
                "name": "conv1d_10",
                "inbound_nodes": [
                    [
                        [
                            "lambda_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_17",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        2
                    ],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "gamma_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_mean_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_variance_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        3,
                        12
                    ]
                },
                "name": "batch_normalization_17",
                "inbound_nodes": [
                    [
                        [
                            "conv1d_10",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Activation",
                "config": {
                    "name": "activation_19",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "elu"
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        3,
                        12
                    ]
                },
                "name": "activation_19",
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_17",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_14",
                    "trainable": true,
                    "dtype": "float32",
                    "rate": 0.3,
                    "noise_shape": null,
                    "seed": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        3,
                        12
                    ]
                },
                "name": "dropout_14",
                "inbound_nodes": [
                    [
                        [
                            "activation_19",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Conv1D",
                "config": {
                    "name": "conv1d_11",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 12,
                    "kernel_size": [
                        4
                    ],
                    "strides": [
                        1
                    ],
                    "padding": "causal",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "HeUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        3,
                        12
                    ]
                },
                "name": "conv1d_11",
                "inbound_nodes": [
                    [
                        [
                            "dropout_14",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_18",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        2
                    ],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "gamma_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_mean_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_variance_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        3,
                        12
                    ]
                },
                "name": "batch_normalization_18",
                "inbound_nodes": [
                    [
                        [
                            "conv1d_11",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Activation",
                "config": {
                    "name": "activation_20",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "elu"
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        3,
                        12
                    ]
                },
                "name": "activation_20",
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_18",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_15",
                    "trainable": true,
                    "dtype": "float32",
                    "rate": 0.3,
                    "noise_shape": null,
                    "seed": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        3,
                        12
                    ]
                },
                "name": "dropout_15",
                "inbound_nodes": [
                    [
                        [
                            "activation_20",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Conv1D",
                "config": {
                    "name": "conv1d_12",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 12,
                    "kernel_size": [
                        1
                    ],
                    "strides": [
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        3,
                        16
                    ]
                },
                "name": "conv1d_12",
                "inbound_nodes": [
                    [
                        [
                            "lambda_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Add",
                "config": {
                    "name": "add_4",
                    "trainable": true,
                    "dtype": "float32"
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        [
                            null,
                            3,
                            12
                        ],
                        [
                            null,
                            3,
                            12
                        ]
                    ]
                },
                "name": "add_4",
                "inbound_nodes": [
                    [
                        [
                            "dropout_15",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv1d_12",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Activation",
                "config": {
                    "name": "activation_21",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "elu"
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        3,
                        12
                    ]
                },
                "name": "activation_21",
                "inbound_nodes": [
                    [
                        [
                            "add_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Conv1D",
                "config": {
                    "name": "conv1d_13",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 12,
                    "kernel_size": [
                        4
                    ],
                    "strides": [
                        1
                    ],
                    "padding": "causal",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        2
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "HeUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        3,
                        12
                    ]
                },
                "name": "conv1d_13",
                "inbound_nodes": [
                    [
                        [
                            "activation_21",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_19",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        2
                    ],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "gamma_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_mean_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_variance_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        3,
                        12
                    ]
                },
                "name": "batch_normalization_19",
                "inbound_nodes": [
                    [
                        [
                            "conv1d_13",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Activation",
                "config": {
                    "name": "activation_22",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "elu"
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        3,
                        12
                    ]
                },
                "name": "activation_22",
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_19",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_16",
                    "trainable": true,
                    "dtype": "float32",
                    "rate": 0.3,
                    "noise_shape": null,
                    "seed": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        3,
                        12
                    ]
                },
                "name": "dropout_16",
                "inbound_nodes": [
                    [
                        [
                            "activation_22",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Conv1D",
                "config": {
                    "name": "conv1d_14",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 12,
                    "kernel_size": [
                        4
                    ],
                    "strides": [
                        1
                    ],
                    "padding": "causal",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        2
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "HeUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        3,
                        12
                    ]
                },
                "name": "conv1d_14",
                "inbound_nodes": [
                    [
                        [
                            "dropout_16",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_20",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        2
                    ],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "gamma_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
