{
    "class_name": "Functional",
    "config": {
        "name": "ATCNet",
        "trainable": true,
        "layers": [
            {
                "module": "keras.layers",
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        1125,
                        22,
                        1
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "input_eeg"
                },
                "registered_name": null,
                "name": "input_eeg",
                "inbound_nodes": []
            },
            {
                "module": "keras.layers",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_2",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 16,
                    "kernel_size": [
                        64,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": {
                        "module": "keras.regularizers",
                        "class_name": "L2",
                        "config": {
                            "l2": 0.008999999612569809
                        },
                        "registered_name": null
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": {
                        "module": "keras.constraints",
                        "class_name": "MaxNorm",
                        "config": {
                            "max_value": 0.6,
                            "axis": [
                                0,
                                1,
                                2
                            ]
                        },
                        "registered_name": null
                    },
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        1125,
                        22,
                        1
                    ]
                },
                "name": "conv2d_2",
                "inbound_nodes": [
                    [
                        [
                            "input_eeg",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_23",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        3
                    ],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "gamma_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_mean_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_variance_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        1125,
                        22,
                        16
                    ]
                },
                "name": "batch_normalization_23",
                "inbound_nodes": [
                    [
                        [
                            "conv2d_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "DepthwiseConv2D",
                "config": {
                    "name": "depthwise_conv2d_1",
                    "trainable": true,
                    "dtype": "float32",
                    "kernel_size": [
                        1,
                        22
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "depth_multiplier": 2,
                    "depthwise_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "depthwise_regularizer": {
                        "module": "keras.regularizers",
                        "class_name": "L2",
                        "config": {
                            "l2": 0.008999999612569809
                        },
                        "registered_name": null
                    },
                    "depthwise_constraint": {
                        "module": "keras.constraints",
                        "class_name": "MaxNorm",
                        "config": {
                            "max_value": 0.6,
                            "axis": [
                                0,
                                1,
                                2
                            ]
                        },
                        "registered_name": null
                    }
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        1125,
                        22,
                        16
                    ]
                },
                "name": "depthwise_conv2d_1",
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_23",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_24",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        3
                    ],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "gamma_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_mean_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_variance_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        1125,
                        1,
                        32
                    ]
                },
                "name": "batch_normalization_24",
                "inbound_nodes": [
                    [
                        [
                            "depthwise_conv2d_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Activation",
                "config": {
                    "name": "activation_32",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "elu"
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        1125,
                        1,
                        32
                    ]
                },
                "name": "activation_32",
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_24",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "AveragePooling2D",
                "config": {
                    "name": "average_pooling2d_2",
                    "trainable": true,
                    "dtype": "float32",
                    "pool_size": [
                        8,
                        1
                    ],
                    "padding": "valid",
                    "strides": [
                        8,
                        1
                    ],
                    "data_format": "channels_last"
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        1125,
                        1,
                        32
                    ]
                },
                "name": "average_pooling2d_2",
                "inbound_nodes": [
                    [
                        [
                            "activation_32",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_27",
                    "trainable": true,
                    "dtype": "float32",
                    "rate": 0.3,
                    "noise_shape": null,
                    "seed": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        140,
                        1,
                        32
                    ]
                },
                "name": "dropout_27",
                "inbound_nodes": [
                    [
                        [
                            "average_pooling2d_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_3",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 32,
                    "kernel_size": [
                        16,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": {
                        "module": "keras.regularizers",
                        "class_name": "L2",
                        "config": {
                            "l2": 0.008999999612569809
                        },
                        "registered_name": null
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": {
                        "module": "keras.constraints",
                        "class_name": "MaxNorm",
                        "config": {
                            "max_value": 0.6,
                            "axis": [
                                0,
                                1,
                                2
                            ]
                        },
                        "registered_name": null
                    },
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        140,
                        1,
                        32
                    ]
                },
                "name": "conv2d_3",
                "inbound_nodes": [
                    [
                        [
                            "dropout_27",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_25",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        3
                    ],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "gamma_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_mean_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_variance_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        140,
                        1,
                        32
                    ]
                },
                "name": "batch_normalization_25",
                "inbound_nodes": [
                    [
                        [
                            "conv2d_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Activation",
                "config": {
                    "name": "activation_33",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "elu"
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        140,
                        1,
                        32
                    ]
                },
                "name": "activation_33",
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_25",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "AveragePooling2D",
                "config": {
                    "name": "average_pooling2d_3",
                    "trainable": true,
                    "dtype": "float32",
                    "pool_size": [
                        7,
                        1
                    ],
                    "padding": "valid",
                    "strides": [
                        7,
                        1
                    ],
                    "data_format": "channels_last"
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        140,
                        1,
                        32
                    ]
                },
                "name": "average_pooling2d_3",
                "inbound_nodes": [
                    [
                        [
                            "activation_33",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_28",
                    "trainable": true,
                    "dtype": "float32",
                    "rate": 0.3,
                    "noise_shape": null,
                    "seed": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        20,
                        1,
                        32
                    ]
                },
                "name": "dropout_28",
                "inbound_nodes": [
                    [
                        [
                            "average_pooling2d_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Lambda",
                "config": {
                    "name": "lambda_6",
                    "trainable": true,
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAAAAAAYAAAATAAAA8yYAAACXAHwAZABkAIUCZABkAIUCZAFkAGQAhQJmBBkAAAAA\nAAAAAABTAKkCTun/////qQCpAdoBeHMBAAAAIPpML2V0aW5mby91c2VyczIvcWxhbmdsb2lzL2hh\nY2thdG9uXzIwMjQvY3VzdG9tX2FyY2hpdGVjdHVyZXMvc290YV9lZWdfYXJjaC5wefoIPGxhbWJk\nYT76GkFUQ05ldFYyLjxsb2NhbHM+LjxsYW1iZGE+lAAAAHMeAAAAgACYYaABoAGgAaAhoCGgIaBC\noHGgcaBxoAica4AA8wAAAAA=\n",
                        null,
                        null
                    ],
                    "function_type": "lambda",
                    "module": "custom_architectures.sota_eeg_arch",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "output_shape_module": null,
                    "arguments": {}
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        20,
                        1,
                        32
                    ]
                },
                "name": "lambda_6",
                "inbound_nodes": [
                    [
                        [
                            "dropout_28",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.src.layers.core.tf_op_layer",
                "class_name": "SlicingOpLambda",
                "config": {
                    "name": "tf.__operators__.getitem_5",
                    "trainable": true,
                    "dtype": "float32",
                    "function": "__operators__.getitem"
                },
                "registered_name": "SlicingOpLambda",
                "build_config": {
                    "input_shape": [
                        null,
                        20,
                        32
                    ]
                },
                "name": "tf.__operators__.getitem_5",
                "inbound_nodes": [
                    [
                        "lambda_6",
                        0,
                        0,
                        {
                            "slice_spec": [
                                {
                                    "start": null,
                                    "stop": null,
                                    "step": null
                                },
                                {
                                    "start": 0,
                                    "stop": 16,
                                    "step": null
                                },
                                {
                                    "start": null,
                                    "stop": null,
                                    "step": null
                                }
                            ]
                        }
                    ]
                ]
            },
            {
                "module": "keras.src.layers.core.tf_op_layer",
                "class_name": "SlicingOpLambda",
                "config": {
                    "name": "tf.__operators__.getitem_6",
                    "trainable": true,
                    "dtype": "float32",
                    "function": "__operators__.getitem"
                },
                "registered_name": "SlicingOpLambda",
                "build_config": {
                    "input_shape": [
                        null,
                        20,
                        32
                    ]
                },
                "name": "tf.__operators__.getitem_6",
                "inbound_nodes": [
                    [
                        "lambda_6",
                        0,
                        0,
                        {
                            "slice_spec": [
                                {
                                    "start": null,
                                    "stop": null,
                                    "step": null
                                },
                                {
                                    "start": 1,
                                    "stop": 17,
                                    "step": null
                                },
                                {
                                    "start": null,
                                    "stop": null,
                                    "step": null
                                }
                            ]
                        }
                    ]
                ]
            },
            {
                "module": "keras.src.layers.core.tf_op_layer",
                "class_name": "SlicingOpLambda",
                "config": {
                    "name": "tf.__operators__.getitem_7",
                    "trainable": true,
                    "dtype": "float32",
                    "function": "__operators__.getitem"
                },
                "registered_name": "SlicingOpLambda",
                "build_config": {
                    "input_shape": [
                        null,
                        20,
                        32
                    ]
                },
                "name": "tf.__operators__.getitem_7",
                "inbound_nodes": [
                    [
                        "lambda_6",
                        0,
                        0,
                        {
                            "slice_spec": [
                                {
                                    "start": null,
                                    "stop": null,
                                    "step": null
                                },
                                {
                                    "start": 2,
                                    "stop": 18,
                                    "step": null
                                },
                                {
                                    "start": null,
                                    "stop": null,
                                    "step": null
                                }
                            ]
                        }
                    ]
                ]
            },
            {
                "module": "keras.src.layers.core.tf_op_layer",
                "class_name": "SlicingOpLambda",
                "config": {
                    "name": "tf.__operators__.getitem_8",
                    "trainable": true,
                    "dtype": "float32",
                    "function": "__operators__.getitem"
                },
                "registered_name": "SlicingOpLambda",
                "build_config": {
                    "input_shape": [
                        null,
                        20,
                        32
                    ]
                },
                "name": "tf.__operators__.getitem_8",
                "inbound_nodes": [
                    [
                        "lambda_6",
                        0,
                        0,
                        {
                            "slice_spec": [
                                {
                                    "start": null,
                                    "stop": null,
                                    "step": null
                                },
                                {
                                    "start": 3,
                                    "stop": 19,
                                    "step": null
                                },
                                {
                                    "start": null,
                                    "stop": null,
                                    "step": null
                                }
                            ]
                        }
                    ]
                ]
            },
            {
                "module": "keras.src.layers.core.tf_op_layer",
                "class_name": "SlicingOpLambda",
                "config": {
                    "name": "tf.__operators__.getitem_9",
                    "trainable": true,
                    "dtype": "float32",
                    "function": "__operators__.getitem"
                },
                "registered_name": "SlicingOpLambda",
                "build_config": {
                    "input_shape": [
                        null,
                        20,
                        32
                    ]
                },
                "name": "tf.__operators__.getitem_9",
                "inbound_nodes": [
                    [
                        "lambda_6",
                        0,
                        0,
                        {
                            "slice_spec": [
                                {
                                    "start": null,
                                    "stop": null,
                                    "step": null
                                },
                                {
                                    "start": 4,
                                    "stop": 20,
                                    "step": null
                                },
                                {
                                    "start": null,
                                    "stop": null,
                                    "step": null
                                }
                            ]
                        }
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "LayerNormalization",
                "config": {
                    "name": "layer_normalization_5",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        2
                    ],
                    "epsilon": 1e-06,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "gamma_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        16,
                        32
                    ]
                },
                "name": "layer_normalization_5",
                "inbound_nodes": [
                    [
                        [
                            "tf.__operators__.getitem_5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "LayerNormalization",
                "config": {
                    "name": "layer_normalization_6",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        2
                    ],
                    "epsilon": 1e-06,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "gamma_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        16,
                        32
                    ]
                },
                "name": "layer_normalization_6",
                "inbound_nodes": [
                    [
                        [
                            "tf.__operators__.getitem_6",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "LayerNormalization",
                "config": {
                    "name": "layer_normalization_7",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        2
                    ],
                    "epsilon": 1e-06,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "gamma_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        16,
                        32
                    ]
                },
                "name": "layer_normalization_7",
                "inbound_nodes": [
                    [
                        [
                            "tf.__operators__.getitem_7",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "LayerNormalization",
                "config": {
                    "name": "layer_normalization_8",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        2
                    ],
                    "epsilon": 1e-06,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "gamma_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        16,
                        32
                    ]
                },
                "name": "layer_normalization_8",
                "inbound_nodes": [
                    [
                        [
                            "tf.__operators__.getitem_8",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "LayerNormalization",
                "config": {
                    "name": "layer_normalization_9",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        2
                    ],
                    "epsilon": 1e-06,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "gamma_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        16,
                        32
                    ]
                },
                "name": "layer_normalization_9",
                "inbound_nodes": [
                    [
                        [
                            "tf.__operators__.getitem_9",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "MultiHeadAttention",
                "config": {
                    "name": "multi_head_attention_5",
                    "trainable": true,
                    "dtype": "float32",
                    "num_heads": 2,
                    "key_dim": 8,
                    "value_dim": 8,
                    "dropout": 0.5,
                    "use_bias": true,
                    "output_shape": null,
                    "attention_axes": [
                        1
                    ],
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "query_shape": [
                        null,
                        16,
                        32
                    ],
                    "key_shape": [
                        null,
                        16,
                        32
                    ],
                    "value_shape": [
                        null,
                        16,
                        32
                    ]
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        16,
                        32
                    ]
                },
                "name": "multi_head_attention_5",
                "inbound_nodes": [
                    [
                        [
                            "layer_normalization_5",
                            0,
                            0,
                            {
                                "value": [
                                    "layer_normalization_5",
                                    0,
                                    0
                                ]
                            }
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "MultiHeadAttention",
                "config": {
                    "name": "multi_head_attention_6",
                    "trainable": true,
                    "dtype": "float32",
                    "num_heads": 2,
                    "key_dim": 8,
                    "value_dim": 8,
                    "dropout": 0.5,
                    "use_bias": true,
                    "output_shape": null,
                    "attention_axes": [
                        1
                    ],
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "query_shape": [
                        null,
                        16,
                        32
                    ],
                    "key_shape": [
                        null,
                        16,
                        32
                    ],
                    "value_shape": [
                        null,
                        16,
                        32
                    ]
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        16,
                        32
                    ]
                },
                "name": "multi_head_attention_6",
                "inbound_nodes": [
                    [
                        [
                            "layer_normalization_6",
                            0,
                            0,
                            {
                                "value": [
                                    "layer_normalization_6",
                                    0,
                                    0
                                ]
                            }
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "MultiHeadAttention",
                "config": {
                    "name": "multi_head_attention_7",
                    "trainable": true,
                    "dtype": "float32",
                    "num_heads": 2,
                    "key_dim": 8,
                    "value_dim": 8,
                    "dropout": 0.5,
                    "use_bias": true,
                    "output_shape": null,
                    "attention_axes": [
                        1
                    ],
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "query_shape": [
                        null,
                        16,
                        32
                    ],
                    "key_shape": [
                        null,
                        16,
                        32
                    ],
                    "value_shape": [
                        null,
                        16,
                        32
                    ]
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        16,
                        32
                    ]
                },
                "name": "multi_head_attention_7",
                "inbound_nodes": [
                    [
                        [
                            "layer_normalization_7",
                            0,
                            0,
                            {
                                "value": [
                                    "layer_normalization_7",
                                    0,
                                    0
                                ]
                            }
                        ]
                    ]
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "MultiHeadAttention",
